app/controllers/movies_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @movie = Movie.new
    @user = User.find(params[:user_id])